def n(): 
 f = int(input("Выберите тип действия(+,-,*,/): ")); 
def m(): 
 while(f == +): 
 a = int(input("Введите 1-ое число: ")); 
 b = int(input("Введите 2-ое число: ")); 
 c = a + b; 
 print("Результат: ", c); 
 while(f == -): 
 a = int(input("Введите 1-ое число: ")); 
 b = int(input("Введите 2-ое число: ")); 
 c = a - b; 
 print("Результат: ", c); 
 while(f == *): 
 a = int(input("Введите 1-ое число: ")); 
 b = int(input("Введите 2-ое число: ")); 
 c = a * b; 
 print("Результат: ", c); 
 while(f == /): 
 a = int(input("Введите 1-ое число: ")); 
 b = int(input("Введите 2-ое число: ")); 
 c = a / b; 
 print("Результат: ", c); 
 else: 
 print(""" 
 
 
 Некорректный тип данных. 
 Или........... 
 Я сего-то не знаю??? 
 
 
 """); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m(); 
n(); 
m();
